app/controllers/icons_controller.rb

  def set_icon
    @icon = Icon.find_by(user_id: params[:user_id])
---
SELECT  `icons`.* FROM `icons` WHERE `icons`.`user_id` = 90 LIMIT 1