app/controllers/images_controller.rb

SELECT  `images`.* FROM `images` WHERE `images`.`post_id` = 23810 LIMIT 1
---
  def set_image
    @image = Image.find_by(post_id: params[:post_id])