app/controllers/initialize_controller.rb

  def do
    Comment.where("id > 582774").delete_all
    Following.where("id > 276810").delete_all
    Icon.where("id > 500").delete_all
    Image.where("id > 24095").delete_all
    Like.where("id > 582777").delete_all
    Post.where("id > 23812").delete_all
    User.where("id > 5862").delete_all
---
DELETE FROM `comments` WHERE (id > 582774)
DELETE FROM `followings` WHERE (id > 276810)
DELETE FROM `icons` WHERE (id > 500)
DELETE FROM `images` WHERE (id > 24095)
DELETE FROM `likes` WHERE (id > 582777)
DELETE FROM `posts` WHERE (id > 23812)
DELETE FROM `users` WHERE (id > 5862)